Revit 2027 API
IFCExtrusionCreationData.AllowVerticalOffsetOfBReps Property
 Allows vertical shifting of breps when moving towards the origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowVerticalOffsetOfBReps { get; set; }
Public Property AllowVerticalOffsetOfBReps As Boolean
	Get
	Set
public:
property bool AllowVerticalOffsetOfBReps {
	bool get ();
	void set (bool value);
}
member AllowVerticalOffsetOfBReps : bool with get, set
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace